app/controllers/api/v1/vendors_controller.rb

    def show
      @vendor = Vendor.find(params[:id])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]