app/controllers/api/v1/venues_controller.rb

    def show
      @venue = Venue.find(params[:id])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]